{"class_name": "Sequential", "keras_version": "2.2.0", "backend": "theano", "config": [{"class_name": "LSTM", "config": {"return_state": false, "kernel_constraint": null, "batch_input_shape": [653, 1, 257], "recurrent_dropout": 0.0, "trainable": true, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "name": "lstm_1", "bias_regularizer": null, "stateful": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activation": "tanh", "bias_constraint": null, "unit_forget_bias": true, "dtype": "float32", "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 1, "units": 257, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "return_sequences": true, "dropout": 0.0}}]}