{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "batch_input_shape": [null, 257, 1], "return_sequences": true, "activation": "tanh", "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "return_state": false, "dtype": "float32", "go_backwards": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "units": 1, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "name": "lstm_1", "trainable": true, "bias_constraint": null, "dropout": 0.0}}]}